# SchedulableField Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SchedulableField Members
SchedulableField Class Constructors Methods Operators Properties See Also
---
The SchedulableField type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SchedulableField()()()() | Creates a new SchedulableField. |
| SchedulableField(Guid) | Creates a new SchedulableField. |
| SchedulableField(ScheduleFieldType) | Creates a new SchedulableField. |
| SchedulableField(ScheduleFieldType, ElementId) | Creates a new SchedulableField. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the SchedulableField |
| Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
| GetCustomFieldData | Gets the data associated with this custom field. If this field isn't a CustomField will return nullNothingnullptra null reference (Nothing in Visual Basic). |
| GetHashCode | Gets the integer value of the SchedulableField as hash code  (Overrides Object..::..GetHashCode()()()().) |
| GetName | Gets the name of the field. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Operators
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equality | Determines whether two SchedulableField are the same. |
| Inequality | Determines whether two SchedulableField are different. |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FieldType | The type of data displayed by the field. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ParameterId | The ID of the parameter displayed by the field. |

# See Also
SchedulableField Class
Autodesk.Revit.DB Namespace